Show / Hide Table of Contents
Enum CheckResult
The number in enum value description means the priority for extreme check evaluation.
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum CheckResult
Fields
 Name |  Description
 Failed
check value is bigger than limit check value
 FailedWithError
error appeared during calculation, calculation was terminated
 CheckIsNotNecesssary
check for some reason not necessary
 CheckIsOff
this kind of the calculation was switched off
 NotDone
this kind of the calculation was not done
 Passed
check value is lesser than limit check value
 PassedWithWarnings
check value is lesser than limit check value, but there is a warning in calculation
 Improve this Doc
 View Source